Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: These settings apply to the %field field everywhere it is used. These settings impact the way that data is stored in the database and cannot be changed once data has been created.
be: Гэтыя наладкі прымяняюцца да поля %field ўсюды, дзе яно ўжываецца. Гэтыя наладкі ўплываюць на спосаб захоўвання дадзеных ў базе дадзеных, і ня могуць быць змененыя пасля таго, як дадзеныя былі створаны.

source: These settings only exist for all the templates and styles based on the %engine theme engine.
be: Гэныя наладкі існуюць толькі для шаблёнаў ды стыляў, заснаваных на рухавіку тэмаў %engine.

source: These settings only exist for the %theme theme and all the styles based on it.
be: Гэтыя наладкі існуюць толькі для тэмы %theme ды ўсіх заснаваных на ёй стылях.

source: These settings only exist for the themes based on the %engine theme engine.
be: Гэтыя наладкі існуюць толькі для тэм, заснаваных па прынцыпе тэмы %engine.

source: This IP address is already blocked.
be: Гэты IP адрас ужо заблакаваны.

source: This OpenID will be attached to your account after registration.
be: Гэты OpenID будзе далучаны да вашага рахунка пасля рэгістрацыі.

source: This URL is not valid.
be: Гэты URL несапраўдны.

source: This account's default language for e-mails, and preferred language for site presentation.
be: Гэта стандартная мова аккаунта для электронных лістоў, і пераважная мова для адлюстравання сайта.

source: This account's default language for e-mails.
be: Гэта стандартная мова аккаунта для e-mail.

source: This action cannot be undone.
be: Гэтае дзеянне нельга будзе адмяніць.

source: This action cannot be undone. If users have entered values into this field in their profile, these entries will also be deleted. If you want to keep the user-entered data, instead of deleting the field you may wish to <a href="@edit-field">edit this field</a> and change it to a hidden profile field so that it may only be accessed by administrators.
be: Гэта дзеянне не можа быць адменена. Калі карыстальнікі маюць уведзеныя значэнні ў гэтым полі свайго профілю, гэтыя запісы таксама будуць выдалены. Калі вы жадаеце захаваць уведзеныя карыстальнікам дадзеныя, замест таго, каб выдаліць поле, вы можаце <a href="@edit-field"> рэдагаваць гэтае поле </a> і змяніць яго на ўтоенае поле профілю, даступнае толькі адміністратарам.

source: This action rebuilds all permissions on site content, and may be a lengthy process. This action cannot be undone.
be: Гэтае дзеянне перабудоўвае ўсе правы на змесціва сайта, гэта можа заняць шмат часу. Адмена гэтага дзеяння немагчымая.

source: This allows authors to input an explicit summary, to be displayed instead of the automatically trimmed text when using the "Summary or trimmed" display type.
be: Гэта дазваляе аўтарам уводзіць пашыранае рэзюмэ, якое будзе паказвацца замест аўтаматычна абрэзанага тэксту, калі выкарыстоўваецца рэжым паказу "Рэзюмэ або абрэзаны тэкст".

source: This block is only shown if <a href="@languages">at least two languages are enabled</a> and <a href="@configuration">language negotiation</a> is set to <em>URL</em> or <em>Session</em>.
be: Гэты блок паказваецца, калі <a href="@languages"> па меньшай меры дзве мовы ўключаны</a> і <a href="@configuration">узгодненная мова</a> усталявана ў <em>URL</em> або <em>Сесія</em>.

source: This book has been modified by another user, the changes could not be saved.
be: Гэта кніга была зменена іншым карыстальнікам, змены не могуць быць захаваны.

source: This cannot be undone.
be: Дзеянне не можа быць адменена.

source: This content type does not have a title field.
be: У гэтага тыпу змесціва няма загалоўка поля.

source: This dashboard region is empty. Click <em>Customize dashboard</em> to add blocks to it.
be: Гэта панэль інструментаў рэгіёну пустая. Націсніце <em>Наладіць панэль інструментаў</em> каб дадаць блокі да яе.

source: This date type already exists. Enter a unique type.
be: Гэты тып даты ўжо існуе. Увядзіце ўнікальны тып.

source: This discussion is closed: you can't post new comments.
be: Абмеркаванне закрытае: Вы ня можаце дадаваць новыя камэнтары.

source: This field has been disabled because you do not have sufficient permissions to edit it.
be: Гэта поля было адключана, паколькі ў вас няма дастатковых правоў для яго рэдагавання.

source: This field is <strong>locked</strong> and cannot be deleted.
be: Гэтае поле <strong>зачынена</strong> і не можа быць выдалена.

source: This field is required.
be: Абавязковае поле.

source: This field stores a number in the database as an integer.
be: Гэта поле запамінае лічбы ў базе дадзеных як цэлыя.

source: This field stores a number in the database in a fixed decimal format.
be: Гэта поле захоўвае нумар у базе дадзеных у дзесятковым фармаце.

source: This field stores a number in the database in a floating point format.
be: Гэта поле захоўвае лікі ў базу дадзеных у фармаце ліка з нефіксаванай коскай.

source: This field stores a reference to a taxonomy term.
be: Гэта поле ўтрымоўвае спасылку на тэрмін таксанаміі.

source: This field stores float values from a list of allowed 'value => label' pairs, i.e. 'Fraction': 0 => 0, .25 => 1/4, .75 => 3/4, 1 => 1.
be: Гэта поле захоўвае лікі з нефіксаванай коскай са спіса дазволеных параў 'значэнне => цэтлік', напрыклад 'Дроб': 0 => 0, .25 => 1/4, .75 => 3/4, 1 => 1.

source: This field stores integer values from a list of allowed 'value => label' pairs, i.e. 'Lifetime in days': 1 => 1 day, 7 => 1 week, 31 => 1 month.
be: Гэтае поле захоўвае цэлыя значэнні са спісу дазволеных параў: 'value => label'. Напрыклад, 'Працягласць у днях': 1 => 1 дзень, 7 => 1 тыдзень, 31 => 1 месяц.

source: This field stores long text in the database along with optional summary text.
be: Гэта поле захоўвае доўгі тэкст у базе дадзенах разам з неабавязковым тэкстам рэзюмэ.

source: This field stores long text in the database.
be: Гэта поле захоўвае доўгі тэкст у базе дадзеных.

source: This field stores simple on/off or yes/no options.
be: Гэта поле захоўвае проста значэнні ўключана/выключана (on/off) альбо так/не (yes/no) .

source: This field stores text values from a list of allowed 'value => label' pairs, i.e. 'US States': IL => Illinois, IA => Iowa, IN => Indiana.
be: Гэтае поле захоўвае тэкставыя значэнні спісам дазволены параў 'value => label'. Напрыклад 'Беларусь': Бр.вобл. => Брэская вобласць, Гр.вобл. => Гронднеская вобласць.

source: This field stores the ID of a file as an integer value.
be: Гэтае поле захоўвае ID файла як цэлы лік.

source: This field stores the ID of an image file as an integer value.
be: Гэта поле захоўвае ID файла малюнка ў выглядзе цэлалікавага значэння.

source: This field stores varchar text in the database.
be: Гэта поле захоўвае тэкст varchar у базе дадзеных.

source: This form lets administrators add, edit, and arrange fields for storing user data.
be: Гэта форма дазваляе адміністратарам дадаваць, рэдагаваць ды мяняць месцамі палі для захавання дадзеных карыстальніка.

source: This form lets administrators configure how fields should be displayed when rendering a user profile page.
be: Гэта форма дазваляе адміністратарам канфігураваць вывад палёў на старонцы профіля карыстальніка.

source: This format already exists. Enter a unique format string.
be: Гэты фармат ужо існуе. Калі ласка, увядзіце ўнікальны фармат радка.

source: This function can only be used to delete fields without data
be: Гэта функцыя можа звычайна выдаляць палі без дадзеных.

source: This image style is being provided by %module module and may not be renamed.
be: Гэты стыль выяў забяспечваецца модулем %module і не можа быць перайменаваны.

source: This image style is currently being provided by a module. Click the "Override defaults" button to change its settings.
be: Зараз гэты стыль выяў забяспечваецца модулем. Націсніце кнопку "Адмяніць значэнні па змоўчанні", каб змяніць яго наладкі.

source: This is compulsory for 'required' fields.
be: Гэта з'яўляецца абавязковым для 'абавязковых' палёў

source: This is only used when the site is configured to use a separate administration theme on the <a href="@appearance-url">Appearance</a> page.
be: Гэта выкарыстоўваецца толькі ў тым выпадку, калі сайт сканфігураваны для выкарыстання асобнай тэмы адміністраваньня на <a href="@appearance-url">старонцы выгляду</a>.

source: This is the body of the email.
be: Гэта змест электроннай пошты.

source: This is the designated forum vocabulary. Some of the normal vocabulary options have been removed.
be: Гэта вызначаны форумам слоўнік. Некаторыя наладкі звычайнага слоўніка былі выдалены.

source: This is the top-level page in this book.
be: У кнізе гэта старонка вышэйшага ўзроўню.

source: This list shows all fields currently in use for easy reference.
be: Гэты спіс паказвае ўсе палі, якія выкарыстоўваюцца зараз для лягчэйшай адсылцы.

source: This login can be used only once.
be: Гэты логiн можа быць выкарыстаны толькi адзiн раз.

source: This module requires PHP version @php_required and is incompatible with PHP version !php_version.
be: Гэты модуль патрабуе PHP версію @php_required і несумяшчальны з PHP версіяй !php_version.

source: This page allows a translator to search for specific translated and untranslated strings, and is used when creating or editing translations. (Note: For translation tasks involving many strings, it may be more convenient to <a href="@export">export</a> strings for offline editing in a desktop Gettext translation editor.) Searches may be limited to strings found within a specific text group or in a specific language.
be: Гэта старонка дазваляе перакладчыку шукаць вызначаныя перакладзеныя і неперакладзеныя радкі, а таксама выкарыстоўваецца пры стварэнні альбо рэдагаванні перакладаў. (Заўвага: калі ў задачу перакладу ўваходзіць пераклад мноства радкоў, тады больш зручна будзе <a href="@export">экспартаваць</a> радкі для далейшага іх рэдагавання з дапамогай дэсктопнага рэдактара перакладаў Gettext.) Пошук можа быць абмежаваны радкамі, знойдзеннымі ў вызначанай тэкставай групе альбо ў вызначанай мове.

source: This page displays a list of the existing custom profile fields to be displayed on a user's <em>My account</em> page. To provide structure, similar or related fields may be placed inside a category. To add a new category (or edit an existing one), edit a profile field and provide a new category name.
be: Гэтая старонка адлюстроўвае спіс існуючых уласных палёў профіляў, якія могуць адлюстроўвацца на карыстальніцкай старонцы <em>Мой рахунак</em>. Для забеспячэння структуры, аналагічныя або сумежныя палі могуць быць размешчаны ўнутры катэгорыі. Каб дадаць новую катэгорыю (або рэдагаваць існуючую), неабходна рэдагаваць поле профілю і пазначыць новае імя катэгорыі.

source: This page displays all external referrers, or external references to your website.
be: На гэтай старонцы адлюстроўваюцца ўсе вонкавыя крыніцы і спасылкі на ваш сайт.

source: This page displays the site's most recent hits.
be: На гэтай старонцы адлюстроўваюцца нядаўнія наведванні сайта.

source: This page exports the translated strings used by your site. An export file may be in Gettext Portable Object (<em>.po</em>) form, which includes both the original string and the translation (used to share translations with others), or in Gettext Portable Object Template (<em>.pot</em>) form, which includes the original strings only (used to create new translations with a Gettext translation editor).
be: Гэта старонка экспартуе перакладзеныя радкі, якія выкарыстоўваюцца вашым сайтам. Файл экспарту можа быць у выглядзе Gettext Portable Object (<em>.po</em>), які ўключае ў сабе як стандартны радок, так і пераклад (выкарыстоўваецца для таго, каб дзяліцца з іншымі), альбо ў выглядзе Gettext Portable Object Template (<em>.pot</em>), які ўключае ў сабе толькі стандартны радок (выкарыстоўваецца для стварэння новых перакладаў з дапамогай рэдактара перакладаў Gettext).

source: This page imports the translated strings contained in an individual Gettext Portable Object (<em>.po</em>) file. Normally distributed as part of a translation package (each translation package may contain several <em>.po</em> files), a <em>.po</em> file may need to be imported after offline editing in a Gettext translation editor. Importing an individual <em>.po</em> file may be a lengthy process.
be: Гэтая старонка імпартуе перакладзеныя радкі, якія змяшчаюцца ў асобных Gettext Portable Object (<em>.po</em>) файлах. Звычайна пастаўляецца ў складзе пакета перакладаў (пераклад кожнага пакета можа змяшчаць некалькі <em>.po</em> файлаў), <em>.po</em> можа мець неабходнасць быць імпартаваным пасля рэдагавання ў афлайн рэжыме з дапамогай праграмы Gettext. Імпарт асобных <em>.po</em> файлаў можа заняць пэўны час.

source: This page is displayed when no other content matches the requested document. Leave blank to display a generic "page not found" page.
be: Гэта старонка адлюстроўваецца тады, калі ніякае іншае змесціва не адпавядае запытанаму дакументу. Каб адлюстраваць агульную старонку "Старонка не знойдзена", пакіньце яе пустой.

source: This page is displayed when the requested document is denied to the current user. Leave blank to display a generic "access denied" page.
be: Гэта старонка адлюстроўваецца тады, калі доступ да запытанага дакумента забаронены дадзенаму карыстальніку. Пакіньце старонку пустой, каб адлюстроўвалася стандартная старонка "дасяг забаронены".

source: This page provides a drag-and-drop interface for assigning a block to a region, and for controlling the order of blocks within regions. Since not all themes implement the same regions, or display regions in the same way, blocks are positioned on a per-theme basis. Remember that your changes will not be saved until you click the <em>Save blocks</em> button at the bottom of the page. Click the <em>configure</em> link next to each block to configure its specific title and visibility settings.
be: Гэта старонка рэалізуе інтэрфейс "перацягнуць і кінуць" для размяшчэння блока ў рэгіёне і для кантралю парадку блокаў унутры рыгіёнаў. Так як не ўсе тэмы рэалізуюць аднолькавыя рэгіёны і не ўсе тэмы паказваюць рэгіёны аднолькавым чынам, блокі размяшчаюцца зыходзячы з тэмы. Памятайце, што вашы змены не будуць захаваны, пакуль вы не націснеце кнопку <em>Захаваць блокі</em> унізе старонкі. Націсніце спасылку <em>настроіць канфігурацыю</em> побач з кожным блокам, каб наладзіць яго характэрную назву і наладкі бачнасці.

source: This page provides an overview of available translatable strings. Drupal displays translatable strings in text groups; modules may define additional text groups containing other translatable strings. Because text groups provide a method of grouping related strings, they are often used to focus translation efforts on specific areas of the Drupal interface.
be: На гэтай старонцы магчымы прагляд радкоў, даступных для перакладу. Drupal групіруе даступныя для перакладу радкі; модулі могуць дадаваць свае тэкставыя групы з іншымі радкамі для перакладу. Групіроўка радкоў зручна ўжываць для перакладу радкоў у спецыфічных абласцях інтэрфэйса Drupal.

source: This page shows you all available administration tasks for each module.
be: Гэта старонка паказвае ўсе адміністрацыйныя задачы да кожнага модуля.

source: This permission is inherited from the authenticated user role.
be: Гэтыя дазволы адпавядаюць ролі "зарэгістраваны карыстальнік".

source: This project has been labeled insecure by the Drupal security team, and is no longer available for download. Immediately disabling everything included by this project is strongly recommended!
be: Камандай баспекі Drupal гэты праект пазначаны небяспечным, і ён больш не даступны для загрузкі. Не марудзячы забараніце ўсё уключанае ў гэты праект. Строга рэкамендавана!

source: This project has been revoked, and is no longer available for download. Disabling everything included by this project is strongly recommended!
be: Гэты праект ануляваны і больш недаступны для загрузкі. Не марудзячы забараніце ўсё уключанае ў гэты праект. Строга рэкамендавана!

source: This project is no longer supported, and is no longer available for download. Disabling everything included by this project is strongly recommended!
be: Гэты праект больш не падтрымліваецца і больш недаступны для загрузкі. Не марудзячы забараніце ўсё ўключанае ў гэты праект. Строга рэкамендавана!

source: This question is for testing whether you are a human visitor and to prevent automated spam submissions.
be: <p>Гэты тэст мае на мэце праверку, ці Вы - напэўна чалавек, і засцерагчы нас такім чынам ад аўтаматычнай рассылкі нежаданага спаму.</p>

source: This role will be automatically assigned new permissions whenever a module is enabled. Changing this setting will not affect existing permissions.
be: Гэтай ролі будуць аўтаматычна нададзены правы на ўсе модулі. Змена гэтай наладкі не будзе мець эффекту для існуючых правоў.

source: This setting is used as the preferred download method. The use of public files is more efficient, but does not provide any access control.
be: Гэтыя наладкі выкарыстоўваюцца для вызначэння метаду сцягвання файлаў. Выкарыстанне агульнадаступных файлаў больш эфектыўнае, але не дае ніякага кантролю за доступам.

source: This setting only has an effect if the display option is enabled.
be: Гэта наладка мае эфект, толькі калі ўключан параметр адлюстравання.

source: This site allows HTML content. While learning all of HTML may feel intimidating, learning how to use a very small number of the most basic HTML "tags" is very easy. This table provides examples for each tag that is enabled on this site.
be: Гэты сайт дазваляе змесціва на HTML. У той час, як вывучэнне HTML цалкам падаецца пужаючым, навучыцца выкарыстоўваць некаторыя асноўныя HTML "тэгі" даволі проста. Гэта табліца змяшчае прыклады для кожнага тэга, даступнага на гэтым сайце.

source: This site supports <a href="@openid-net">OpenID</a>, a secure way to log in to many websites using a single username and password. OpenID can reduce the necessity of managing many usernames and passwords for many websites.
be: Гэты сайт падтрымлівае <a href="@openid-net">OpenID</a>, бяспечны спосаб уваходзіць на шматлікія сайты, выкарыстоўваючы адно толькі імя карыстальніка і пароль. OpenID можа зменшыць неабходнасць кіравання шматлікімі імёнамі карыстальнікаў і паролямі для вэбсайтаў.

source: This table lists all the recorded votes for this poll. If anonymous users are allowed to vote, they will be identified by the IP address of the computer they used when they voted.
be: У гэтай табліцы пералічаны ўсе зарэгістраваныя галасы ў гэтым апытанні. Калі ананімным карыстальнікам дазволена галасаваць, яны ідэнтыфікуюцца па IP-адрасам кампутараў, якія выкарыстоўваліся імі пры галасаванні.

source: This text is displayed at the picture upload form in addition to the default guidelines. It's useful for helping or instructing your users.
be: Гэты тэкст адлюстраваны на форме загрузкі малюнкаў у дадатак да рэкамендацыі па змаўчанні.

source: This text will be displayed at the top of the page when creating or editing content of this type.
be: Пры ўтварэнні альбо рэдагаванні змесціва гэтага тыпу, дадзены тэкст будзе адлюстраваны зверху старонкі.

source: This text will be used by screen readers, search engines, or when the image cannot be loaded.
be: Гэты тэкст будзе выкарыстаны чытачамі экрану, пошукавымі рухавікамі, і тады, калі малюнак не можа быць загружаны.

source: This theme demonstrates Drupal's default HTML markup and CSS styles. To learn how to build your own theme and override Drupal's default code, see the <a href="http://drupal.org/theme-guide">Theming Guide</a>.
be: Гэта тэма дэманструе будову базавых HTML шаблонаў у Drupal і базавыя стылі CSS. Каб навучыцца рабіць уласныя тэмы і мяняць базавы код Drupal, глядзіце <a href="http://drupal.org/theme-guide">Theming Guide (Дапаможнік па тэмізацыі)</a>.

source: This theme requires PHP version @php_required and is incompatible with PHP version !php_version.
be: Гэтая тэма патрабуе PHP версіі @php_required і несумяшчальна з версіяй PHP !php_version.

source: This topic has been moved
be: Дадзенае абмеркаванне было перасунутае

source: This translation needs to be updated
be: Гэты пераклад павінен быць абноўлены

source: This update is a major version update which means that it may not be backwards compatible with your currently running version. It is recommended that you read the release notes and proceed at your own risk.
be: Гэтае аднаўленне ёсць значнае аднаўленне версіі, якое азначае, што яно не можа быць вернута часткова з вашай цякучай версіі. Рэкамендавана, што вы чытаеце нататкі рэлізаў і працягваеце далейшыя дзеянні на вашую ўласную рызыку.

source: This version is not compatible with Drupal !core_version and should be replaced.
be: Гэта версія не сумяшчальная з Drupal !core_version і павінна быць перамешчана.

source: This web page allows administrators to register new users. Users' e-mail addresses and usernames must be unique.
be: Гэта старонка дазваляе адміністратарам рэгістраваць новых карыстальнікаў. Паштовы адрас ды імя карыстальніка павінны быць унікальныя.

source: This will be the top-level page in this book.
be: Гэта старонка ў кнізе будзе вышэйшага ўзроўню.

source: This will permanently remove the log messages from the database.
be: Гэта будзе пастаянна выдаляць журнальныя паведамленні з базы дадзеных.

source: Thousand marker
be: Тысячны маркер

source: Thousands of sites (particularly news sites and blogs) publish their latest headlines and posts in feeds, using a number of standardized XML-based formats. Formats supported by the aggregator include <a href="@rss">RSS</a>, <a href="@rdf">RDF</a>, and <a href="@atom">Atom</a>.
be: Тысячы сайтаў (асабліва сайты навінаў і блогаў) публікуюць свае апошнія навіны і посты ў фідах, выкарыстоўваючы стандартызаваныя фарматы, якія базуюцца на XML. Фарматы, якія падтрымліваюць модуль-збіральнік (Aggregator) - гэта <a href="@rss">RSS</a>, <a href="@rdf">RDF</a>, і <a href="@atom">Atom</a>.

source: Threaded comments submitted by users (for example, <em>You have these options...</em>).
be: Дрэва каментараў прадастаўленае карыстальнікамі (напрыклад, <em>Вы маеце гэтыя наладкі...</em>).

source: Threaded list
be: Звязаны спіс

source: Threaded list - collapsed
be: Згорнуты іерархічны спіс

source: Threaded list - expanded
be: Разгорнуты іерархічны спіс

source: Threading
be: Арганізацыя струменевай апрацоўкі

source: Throbber
be: Тробер

source: Throttle
be: Рэгулятар

source: Thu
be: чцв

source: Thursday
be: чацьвер

source: Tibetan
be: Тыбэцкая

source: Tigrinya
be: Тыгрынья

source: Time
be: Час

source: Time for publication
be: Час публікацыі

source: Time limit
be: Абмежаванні часу

source: Time zone
be: Часовая зона

source: Time zone for new users
be: Часавая зона для новых карыстальнікаў

source: Time zones
be: Часавыя зоны

source: Timestamp
be: Пазначка даты

source: Timezone
be: Гадзінны пояс

source: Timor-Leste
be: Тымор-Лешти

source: Title
be: Загаловак

source: Title (no link)
be: 1 элемент паспяхова апрацаваны:Загаловак

source: Title and slogan
be: Назва і слоган

source: Title changed from %original to %current.
be: Загаловак зменены з %original на %current.

source: Title field label
be: Цэтлік загалоўка поля

source: Titles only
be: Толькі загалоўкі

source: Titles plus teaser
be: Загалоўкі з падказкамі

source: To
be: Каму

source: To change the current user password, enter the new password in both fields.
be: Каб змяніць бягучы пароль, увядзіце новы ў абодвух палях.

source: To change the password, enter the new password here.
be: Каб змяніць пароль, увядзіце сюды новы.
